# Travel trip data project

## Loading the CSV file

In [55]:
import pandas as pd

travel_trip_data = "../data/raw/Travel details dataset.csv"
travel_trip_christos_df = pd.read_csv(travel_trip_data, encoding='ISO-8859-1')
travel_trip_christos_df.head(10)

,ï»¿Trip ID,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
5,6,"Paris, France",10/5/2023,10/10/2023,5.0,Michael Brown,42.0,Male,American,Hotel,1500,Flight,800
6,7,"Sydney, Australia",11/20/2023,11/30/2023,10.0,Emily Davis,33.0,Female,Australian,Hostel,500,Flight,1200
7,8,"Rio de Janeiro, Brazil",1/5/2024,1/12/2024,7.0,Lucas Santos,25.0,Male,Brazilian,Airbnb,900,Flight,600
8,9,"Amsterdam, Netherlands",2/14/2024,2/21/2024,7.0,Laura Janssen,31.0,Female,Dutch,Hotel,1200,Train,200
9,10,"Dubai, United Arab Emirates",3/10/2024,3/17/2024,7.0,Mohammed Ali,39.0,Male,Emirati,Resort,2500,Flight,800

In [56]:
travel_trip_christos_df.columns

Index(['ï»¿Trip ID', 'Destination', 'Start date', 'End date',
       'Duration (days)', 'Traveler name', 'Traveler age', 'Traveler gender',
       'Traveler nationality', 'Accommodation type', 'Accommodation cost',
       'Transportation type', 'Transportation cost'],
      dtype='object')

In [57]:
travel_trip_christos_df.columns = travel_trip_christos_df.columns.str.replace("ï»¿", "", regex=False).str.replace(r"[()]", "", regex=True).str.strip(")").str.replace(" ","_").str.lower()
travel_trip_christos_df.columns

Index(['trip_id', 'destination', 'start_date', 'end_date', 'duration_days',
       'traveler_name', 'traveler_age', 'traveler_gender',
       'traveler_nationality', 'accommodation_type', 'accommodation_cost',
       'transportation_type', 'transportation_cost'],
      dtype='object')

In [58]:
travel_trip_christos_df.head(1)

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600

## Cleaning dataframe

### Starting with "destination"

In [59]:
# I want to take the column destination, and rather split it in two, destination_city and destination_country

# Split on the first comma into two columns
travel_trip_christos_df[["destination_city", "destination_country"]] = (
    travel_trip_christos_df["destination"]
        .str.split(",", n=1, expand=True)
)

# Clean up whitespace
travel_trip_christos_df["destination_city"] = (
    travel_trip_christos_df["destination_city"].str.strip()
)
travel_trip_christos_df["destination_country"] = (
    travel_trip_christos_df["destination_country"].str.strip()
)

travel_trip_christos_df

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost,destination_city,destination_country
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600,London,UK
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500,Phuket,Thailand
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700,Bali,Indonesia
3,4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000,New York,USA
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200,Tokyo,Japan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,135,"Rio de Janeiro, Brazil",8/1/2023,8/10/2023,9.0,Jose Perez,37.0,Male,Brazilian,Hostel,2500,Car,2000,Rio de Janeiro,Brazil
135,136,"Vancouver, Canada",8/15/2023,8/21/2023,6.0,Emma Wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000,Vancouver,Canada
136,137,"Bangkok, Thailand",9/1/2023,9/8/2023,7.0,Ryan Chen,34.0,Male,Chinese,Hostel,2000,Train,1000,Bangkok,Thailand
137,138,"Barcelona, Spain",9/15/2023,9/22/2023,7.0,Sofia Rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500,Barcelona,Spain
138,139,"Auckland, New Zealand",10/1/2023,10/8/2023,7.0,William Brown,39.0,Male,New Zealander,Hotel,7000,Train,2500,Auckland,New Zealand

In [60]:
# I will drop the column "destination" after merging my table with the cleaned tables with my colleagues working in parallel.

In [61]:
# will however first move the two new columns on the right and next to destination

In [62]:
cols = list(travel_trip_christos_df.columns)
cols.insert(cols.index("destination") + 1, cols.pop(cols.index("destination_city")))
travel_trip_christos_df = travel_trip_christos_df.loc[:, cols]

cols = list(travel_trip_christos_df.columns)
cols.insert(cols.index("destination_city") - 1, cols.pop(cols.index("destination_country")))
travel_trip_christos_df = travel_trip_christos_df.loc[:, cols]

cols = list(travel_trip_christos_df.columns)
cols.insert(cols.index("destination_country") - 1, cols.pop(cols.index("destination")))
travel_trip_christos_df = travel_trip_christos_df.loc[:, cols]

travel_trip_christos_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,"London, UK",1,UK,London,5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,"Phuket, Thailand",2,Thailand,Phuket,6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,"Bali, Indonesia",3,Indonesia,Bali,7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,"New York, USA",4,USA,New York,8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,"Tokyo, Japan",5,Japan,Tokyo,9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,8/1/2023,8/10/2023,9.0,Jose Perez,37.0,Male,Brazilian,Hostel,2500,Car,2000
135,"Vancouver, Canada",136,Canada,Vancouver,8/15/2023,8/21/2023,6.0,Emma Wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000
136,"Bangkok, Thailand",137,Thailand,Bangkok,9/1/2023,9/8/2023,7.0,Ryan Chen,34.0,Male,Chinese,Hostel,2000,Train,1000
137,"Barcelona, Spain",138,Spain,Barcelona,9/15/2023,9/22/2023,7.0,Sofia Rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500
138,"Auckland, New Zealand",139,New Zealand,Auckland,10/1/2023,10/8/2023,7.0,William Brown,39.0,Male,New Zealander,Hotel,7000,Train,2500

### Searching for NaN values

In [64]:
travel_trip_christos_df.isnull().sum()

destination              2
trip_id                  0
destination_country     68
destination_city         2
start_date               2
end_date                 2
duration_days            2
traveler_name            2
traveler_age             2
traveler_gender          2
traveler_nationality     2
accommodation_type       2
accommodation_cost       2
transportation_type      3
transportation_cost      3
dtype: int64

In [65]:
# checking the destinatio column to see what destination_city has so many NaN values. 
# It shows that for many rows we only have information about the city. 
# That's no problem, we can easily extrapolate the country frrom it.
travel_trip_christos_df.destination.unique()

array(['London, UK', 'Phuket, Thailand', 'Bali, Indonesia',
       'New York, USA', 'Tokyo, Japan', 'Paris, France',
       'Sydney, Australia', 'Rio de Janeiro, Brazil',
       'Amsterdam, Netherlands', 'Dubai, United Arab Emirates',
       'Cancun, Mexico', 'Barcelona, Spain', 'Honolulu, Hawaii',
       'Berlin, Germany', 'Marrakech, Morocco', 'Edinburgh, Scotland',
       'Paris', 'Bali', 'London', 'Tokyo', 'New York', 'Sydney', 'Rome',
       'Bangkok', 'Hawaii', 'Barcelona', 'Japan', 'Thailand', 'France',
       'Australia', 'Brazil', 'Greece', 'Egypt', 'Mexico', 'Italy',
       'Spain', 'Canada', 'New York City, USA', 'Bangkok, Thailand',
       'Vancouver, Canada', 'Sydney, AUS', 'Seoul, South Korea',
       'Los Angeles, USA', 'Rome, Italy', 'Cape Town', nan,
       'Cape Town, SA', 'Sydney, Aus', 'Bangkok, Thai', 'Phuket, Thai',
       'Dubai', 'Seoul', 'Rio de Janeiro', 'Amsterdam', 'Phuket',
       'Santorini', 'Phnom Penh', 'Athens, Greece',
       'Cape Town, South Africa', 'Auckland, New Zealand'], dtype=object)

In [66]:
# we can immediately identify that most columns have 2 NaN values. Will do a test to check whether those values are in the same rows

assumption_columns = [
    "destination",
    "destination_city",
    "start_date",
    "end_date",
    "duration_days",
    "traveler_name",
    "traveler_age",
    "traveler_gender",
    "traveler_nationality",
    "accommodation_type",
    "accommodation_cost"
]

all_null_test = travel_trip_christos_df[assumption_columns].isna().all(axis=1)
all_null_count = all_null_test.sum()
print(all_null_count)

2

In [67]:
# our assumption is true, those two rows are fully empty and we can drop them

In [68]:
travel_trip_christos_df = travel_trip_christos_df.dropna(thresh=2)

### Checking for duplicates

In [101]:
travel_trip_christos_df.duplicated().sum()

np.int64(0)

In [70]:
travel_trip_christos_df.traveler_name.duplicated().sum()

np.int64(28)

In [71]:
travel_trip_christos_df.traveler_name.nunique()

109

In [72]:
travel_trip_christos_df.traveler_name.unique()

array(['John Smith', 'Jane Doe', 'David Lee', 'Sarah Johnson',
       'Kim Nguyen', 'Michael Brown', 'Emily Davis', 'Lucas Santos',
       'Laura Janssen', 'Mohammed Ali', 'Ana Hernandez', 'Carlos Garcia',
       'Lily Wong', 'Hans Mueller', 'Fatima Khouri', 'James MacKenzie',
       'Michael Chang', 'Olivia Rodriguez', 'Kenji Nakamura', 'Emily Lee',
       'James Wilson', 'Sofia Russo', 'Raj Patel', 'Lily Nguyen',
       'David Kim', 'Maria Garcia', 'Alice Smith', 'Bob Johnson',
       'Charlie Lee', 'Emma Davis', 'Olivia Martin', 'Harry Wilson',
       'Sophia Lee', 'James Brown', 'Mia Johnson', 'William Davis',
       'Amelia Brown', 'Adam Lee', 'Sarah Wong', 'Maria Silva',
       'Peter Brown', 'Emma Garcia', 'Michael Davis', 'Nina Patel',
       'Kevin Kim', 'Laura van den Berg', 'Jennifer Nguyen', 'Rachel Lee',
       'Jessica Wong', 'Felipe Almeida', 'Nisa Patel', 'Ben Smith',
       'Laura Gomez', 'Park Min Woo', 'Michael Chen', 'Sofia Rossi',
       'Rachel Sanders', 'Emily Watson', 'Ana Rodriguez', 'Tom Wilson',
       'Olivia Green', 'James Chen', 'Lila Patel', 'Marco Rossi',
       'Sarah Brown', 'Sarah Lee', 'Alex Kim', 'Maria Hernandez',
       'Mark Johnson', 'Amanda Chen', 'Nana Kwon', 'Tom Hanks',
       'Emma Watson', 'James Kim', 'Fatima Ahmed', 'Liam Nguyen',
       'Giulia Rossi', 'Putra Wijaya', 'Kim Min-ji', 'Emily Johnson',
       'Michael Wong', 'Jessica Chen', 'Ken Tanaka', 'Rodrigo Oliveira',
       'Olivia Kim', 'Robert Mueller', 'Lisa Chen', 'Emily Wong',
       'Mark Tan', 'Emma Lee', 'George Chen', 'Sophia Kim', 'Alex Ng',
       'Cindy Chen', 'Emily Kim', 'Frank Li', 'Gina Lee', 'Henry Kim',
       'Isabella Chen', 'Jack Smith', 'Katie Johnson', 'John Doe',
       'Jane Smith', 'Michael Johnson', 'Jose Perez', 'Emma Wilson',
       'Ryan Chen', 'Sofia Rodriguez', 'William Brown'], dtype=object)

In [73]:
# I will make sure that the column traveler_name is lowercased and stripped from double spaces or dashes, just in case this might hide more duplicates
# ideally, when you created travel_trip_christos_df, you already did:
# travel_trip_christos_df = original_df[...].copy()

travel_trip_christos_df.loc[:, "traveler_name"] = (
    travel_trip_christos_df["traveler_name"]
        .str.strip()                        # trims whitespace at both ends
        .str.replace("-", " ", regex=False) # replace hyphen with space
        .str.lower()
)
travel_trip_christos_df.traveler_name.unique()

array(['john smith', 'jane doe', 'david lee', 'sarah johnson',
       'kim nguyen', 'michael brown', 'emily davis', 'lucas santos',
       'laura janssen', 'mohammed ali', 'ana hernandez', 'carlos garcia',
       'lily wong', 'hans mueller', 'fatima khouri', 'james mackenzie',
       'michael chang', 'olivia rodriguez', 'kenji nakamura', 'emily lee',
       'james wilson', 'sofia russo', 'raj patel', 'lily nguyen',
       'david kim', 'maria garcia', 'alice smith', 'bob johnson',
       'charlie lee', 'emma davis', 'olivia martin', 'harry wilson',
       'sophia lee', 'james brown', 'mia johnson', 'william davis',
       'amelia brown', 'adam lee', 'sarah wong', 'maria silva',
       'peter brown', 'emma garcia', 'michael davis', 'nina patel',
       'kevin kim', 'laura van den berg', 'jennifer nguyen', 'rachel lee',
       'jessica wong', 'felipe almeida', 'nisa patel', 'ben smith',
       'laura gomez', 'park min woo', 'michael chen', 'sofia rossi',
       'rachel sanders', 'emily watson', 'ana rodriguez', 'tom wilson',
       'olivia green', 'james chen', 'lila patel', 'marco rossi',
       'sarah brown', 'sarah lee', 'alex kim', 'maria hernandez',
       'mark johnson', 'amanda chen', 'nana kwon', 'tom hanks',
       'emma watson', 'james kim', 'fatima ahmed', 'liam nguyen',
       'giulia rossi', 'putra wijaya', 'kim min ji', 'emily johnson',
       'michael wong', 'jessica chen', 'ken tanaka', 'rodrigo oliveira',
       'olivia kim', 'robert mueller', 'lisa chen', 'emily wong',
       'mark tan', 'emma lee', 'george chen', 'sophia kim', 'alex ng',
       'cindy chen', 'emily kim', 'frank li', 'gina lee', 'henry kim',
       'isabella chen', 'jack smith', 'katie johnson', 'john doe',
       'jane smith', 'michael johnson', 'jose perez', 'emma wilson',
       'ryan chen', 'sofia rodriguez', 'william brown'], dtype=object)

In [74]:
travel_trip_christos_df.traveler_name.duplicated().sum()

np.int64(28)

In [75]:
# we can see that there are no exact full string duplicates of the column traveler_name. 
# The number 29 above probalby comes from partial dupication, like only first name or only last name

In [76]:
travel_trip_christos_df.isnull().sum()

destination              0
trip_id                  0
destination_country     66
destination_city         0
start_date               0
end_date                 0
duration_days            0
traveler_name            0
traveler_age             0
traveler_gender          0
traveler_nationality     0
accommodation_type       0
accommodation_cost       0
transportation_type      1
transportation_cost      1
dtype: int64

In [77]:
# let's find out the NaN values in 
mask = travel_trip_christos_df["transportation_type"].isna() & \
       travel_trip_christos_df["transportation_cost"].isna()

travel_trip_christos_df[mask]

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
82,"Rome, Italy",83,Italy,Rome,4/15/2025,4/22/2025,7.0,james kim,41.0,Male,American,Hotel,100,NaN,NaN

In [78]:
travel_trip_christos_df.dtypes

destination              object
trip_id                   int64
destination_country      object
destination_city         object
start_date               object
end_date                 object
duration_days           float64
traveler_name            object
traveler_age            float64
traveler_gender          object
traveler_nationality     object
accommodation_type       object
accommodation_cost       object
transportation_type      object
transportation_cost      object
dtype: object

In [79]:
# for transportation type and transportation_cost NaN values, we will group by destination_city and calculate the count of transportation_type and mean transportation_cost, and filter for Rome.

# we will need to cast the data type of the column transportation_cost to float, before we can proceed with grouping.

# for this to happen we will need to clean the column transportation_cost

In [80]:
travel_trip_christos_df.transportation_cost.unique()

array(['600', '500', '700', '1000', '200', '800', '1200', '100', '400',
       '150', '$400 ', '$700 ', '$150 ', '$800 ', '$100 ', '$600 ',
       '$80 ', '$500 ', '$300 ', '$50 ', '$120 ', '$75 ', '900', '50',
       '$200 ', '$250 ', '$20 ', '300', '800 USD', '200 USD', '500 USD',
       '700 USD', '300 USD', '600 USD', '400 USD', '1000 USD', nan,
       '100 USD', '350 USD', '150 USD', '$1,200 ', '$900 ', '$1,500 ',
       '$1,000 ', '250', '2500', '1500', '2000', '3000'], dtype=object)

In [81]:
# we will need to remove anything but the numbers

In [82]:
travel_trip_christos_df.loc[:, "transportation_cost"] = (
    travel_trip_christos_df["transportation_cost"]
        .astype(str)                      # in case there are numbers/NaN in there
        .str.strip()
        .str.strip("$")
        .str.replace(",", "", regex=False)
        .str.replace(" USD", "", regex=False)
        .str.strip()
)

travel_trip_christos_df.loc[:, "transportation_cost"] = pd.to_numeric(
    travel_trip_christos_df["transportation_cost"],
    errors="coerce"
)

travel_trip_christos_df.transportation_cost.unique()

array([600.0, 500.0, 700.0, 1000.0, 200.0, 800.0, 1200.0, 100.0, 400.0,
       150.0, 80.0, 300.0, 50.0, 120.0, 75.0, 900.0, 250.0, 20.0, nan,
       350.0, 1500.0, 2500.0, 2000.0, 3000.0], dtype=object)

In [83]:
# assuming travel_trip_christos_df was created with .copy() earlier
#travel_trip_christos_df.loc[:, "transportation_cost"] = (
#   travel_trip_christos_df["transportation_cost"]
#     .fillna("0")
# )

# travel_trip_christos_df.transportation_cost.unique()

In [84]:
# now we cast, in order to be able to group later

travel_trip_christos_df.loc[:, "transportation_cost"] = (
    travel_trip_christos_df["transportation_cost"].astype("Int64")
)

travel_trip_christos_df.dtypes

destination              object
trip_id                   int64
destination_country      object
destination_city         object
start_date               object
end_date                 object
duration_days           float64
traveler_name            object
traveler_age            float64
traveler_gender          object
traveler_nationality     object
accommodation_type       object
accommodation_cost       object
transportation_type      object
transportation_cost      object
dtype: object

In [85]:
# for transportation type and transportation_cost NaN values, we will group by destination_city and calculate the count of transportation_type and mean transportation_cost, and filter for Rome.

grouped_df = (travel_trip_christos_df.groupby(["destination_city", "transportation_type"]).agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_mean = ("transportation_cost", "mean")))
filtered_grouped_df = grouped_df.loc[["Rome"]]
filtered_grouped_df

                                      transportation_type_count  \
destination_city transportation_type
Rome             Plane                                        2
                 Train                                        6

                                     transportation_cost_mean
destination_city transportation_type
Rome             Plane                                  625.0
                 Train                                  405.0

In [86]:
# therefore, we will fill the empty values transportation_type with "Train", and transportation_cost with "405.0"
travel_trip_christos_df.loc[:, "transportation_type"] = (
    travel_trip_christos_df["transportation_type"].fillna("Train")
)

travel_trip_christos_df.transportation_type.isnull().sum()

np.int64(0)

In [87]:
# now let's replace the 0 we placed before in place of NaN, with the mean value.
travel_trip_christos_df.loc[:, "transportation_cost"] = (
    travel_trip_christos_df["transportation_cost"].fillna(405.0)
)

travel_trip_christos_df.transportation_cost.isnull().sum()

/var/folders/13/s00136yd6q5bvv6x74_x_m204g4004/T/ipykernel_33666/4279038090.py:3: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  travel_trip_christos_df["transportation_cost"].fillna(405.0)

np.int64(0)

In [88]:
travel_trip_christos_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,"London, UK",1,UK,London,5/1/2023,5/8/2023,7.0,john smith,35.0,Male,American,Hotel,1200,Flight,600.0
1,"Phuket, Thailand",2,Thailand,Phuket,6/15/2023,6/20/2023,5.0,jane doe,28.0,Female,Canadian,Resort,800,Flight,500.0
2,"Bali, Indonesia",3,Indonesia,Bali,7/1/2023,7/8/2023,7.0,david lee,45.0,Male,Korean,Villa,1000,Flight,700.0
3,"New York, USA",4,USA,New York,8/15/2023,8/29/2023,14.0,sarah johnson,29.0,Female,British,Hotel,2000,Flight,1000.0
4,"Tokyo, Japan",5,Japan,Tokyo,9/10/2023,9/17/2023,7.0,kim nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,8/1/2023,8/10/2023,9.0,jose perez,37.0,Male,Brazilian,Hostel,2500,Car,2000.0
135,"Vancouver, Canada",136,Canada,Vancouver,8/15/2023,8/21/2023,6.0,emma wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000.0
136,"Bangkok, Thailand",137,Thailand,Bangkok,9/1/2023,9/8/2023,7.0,ryan chen,34.0,Male,Chinese,Hostel,2000,Train,1000.0
137,"Barcelona, Spain",138,Spain,Barcelona,9/15/2023,9/22/2023,7.0,sofia rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500.0
138,"Auckland, New Zealand",139,New Zealand,Auckland,10/1/2023,10/8/2023,7.0,william brown,39.0,Male,New Zealander,Hotel,7000,Train,2500.0

In [89]:
# let's quickly check the transportation_types

travel_trip_christos_df.transportation_type.unique().sum()

'FlightTrainPlaneBusCar rentalSubwayCarFerryAirplane'

In [90]:
# do we need to also change "Subway" to train? Maybe, who travels to a city using a subway, subways are intra city transportation modes.

In [91]:
subway_df = travel_trip_christos_df.groupby("transportation_type").agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_mean = ("transportation_cost", "mean"))
filtered_subway_df = subway_df.loc[["Subway", "Train"]]
filtered_subway_df

                     transportation_type_count transportation_cost_mean
transportation_type
Subway                                       1                     20.0
Train                                       38               346.184211

In [92]:
travel_trip_christos_df[travel_trip_christos_df["transportation_type"] == "Subway"]

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
57,"Seoul, South Korea",58,South Korea,Seoul,5/10/2024,5/18/2024,8.0,park min woo,27.0,Male,South Korean,Hostel,$500,Subway,20.0

In [93]:
# Subway seems to be an outlier data, but let's check at least if the transportation_cost of the "Subway" is at least close to the minimum cost for "Train"

In [94]:
subway_df = travel_trip_christos_df.groupby("transportation_type").agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_min = ("transportation_cost", "min"))
filtered_subway_df = subway_df.loc[["Subway", "Train"]]
filtered_subway_df

                     transportation_type_count transportation_cost_min
transportation_type
Subway                                       1                    20.0
Train                                       38                    80.0

In [95]:
# this is not the case, therefore, we will exclude it from our calculations of "Train"

In [96]:
# and "Car" and "Car rental" under "Car"?

In [97]:
car_df = travel_trip_christos_df.groupby("transportation_type").agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_mean = ("transportation_cost", "mean"))
filtered_car_df = subway_df.loc[["Car rental", "Car"]]
filtered_car_df

                     transportation_type_count transportation_cost_min
transportation_type
Car rental                                  13                   200.0
Car                                          3                   300.0

In [98]:
# no, we see that there is a massive difference in the mean cost between the two categories, suggesting that it is indeed two different transportation modes. 
# Car rental suggests that someone rented a car at the destnation, where car probably indicates that someone did a road trip using a car to destination.

### Merging equivalent transportations types

In [99]:
# ok, we will merge "Plane" and "Airplane" under "Airplane", and "Car rental" to "Rental Car", and "Car" to "Private Car"
travel_trip_christos_df.loc[:, "transportation_type"] = (
    travel_trip_christos_df["transportation_type"]
        .replace({"Plane": "Airplane"})
)

travel_trip_christos_df.loc[:, "transportation_type"] = (
    travel_trip_christos_df["transportation_type"]
        .replace({"Car rental": "Rental Car"})
)

travel_trip_christos_df.loc[:, "transportation_type"] = (
    travel_trip_christos_df["transportation_type"]
        .replace({"Car": "Private Car"})
)

travel_trip_christos_df["transportation_type"].unique()

array(['Flight', 'Train', 'Airplane', 'Bus', 'Rental Car', 'Subway',
       'Private Car', 'Ferry'], dtype=object)

In [100]:
travel_trip_christos_df.head(10)

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,"London, UK",1,UK,London,5/1/2023,5/8/2023,7.0,john smith,35.0,Male,American,Hotel,1200,Flight,600.0
1,"Phuket, Thailand",2,Thailand,Phuket,6/15/2023,6/20/2023,5.0,jane doe,28.0,Female,Canadian,Resort,800,Flight,500.0
2,"Bali, Indonesia",3,Indonesia,Bali,7/1/2023,7/8/2023,7.0,david lee,45.0,Male,Korean,Villa,1000,Flight,700.0
3,"New York, USA",4,USA,New York,8/15/2023,8/29/2023,14.0,sarah johnson,29.0,Female,British,Hotel,2000,Flight,1000.0
4,"Tokyo, Japan",5,Japan,Tokyo,9/10/2023,9/17/2023,7.0,kim nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200.0
5,"Paris, France",6,France,Paris,10/5/2023,10/10/2023,5.0,michael brown,42.0,Male,American,Hotel,1500,Flight,800.0
6,"Sydney, Australia",7,Australia,Sydney,11/20/2023,11/30/2023,10.0,emily davis,33.0,Female,Australian,Hostel,500,Flight,1200.0
7,"Rio de Janeiro, Brazil",8,Brazil,Rio de Janeiro,1/5/2024,1/12/2024,7.0,lucas santos,25.0,Male,Brazilian,Airbnb,900,Flight,600.0
8,"Amsterdam, Netherlands",9,Netherlands,Amsterdam,2/14/2024,2/21/2024,7.0,laura janssen,31.0,Female,Dutch,Hotel,1200,Train,200.0
9,"Dubai, United Arab Emirates",10,United Arab Emirates,Dubai,3/10/2024,3/17/2024,7.0,mohammed ali,39.0,Male,Emirati,Resort,2500,Flight,800.0